#include <stdio.h>
//操作符 

int add (int x,int y){
	return x+y;
}

int main()
{
	
	//算数操作符
	// 		+		 - 		* 		/ 
	
	int a =7/2;//除法不关心余数
	int b =7%2;//取余数 1 
	printf("%d\n",a);//3
	printf("%d\n",b); //1
	//除号两端都是整数的时候，执行的是整数除法，如果两端只要有一个浮点数就执行浮点数的除法
	 
	float c =7.0 / 2;
	printf("%f\n",c);//3.500000
	printf("%.1f\n",c);//3.5,小数点后只取一位 
	 
	//移位操作符
	//		>>		 << 
	
	
	//位操作符
	//		&		^		|
	
	
	//赋值操作符
	//	=	+=	-=	/=	&=	|=	>>=	<<= 
	
	int d = 0;//初始化
	int e = 5; //也是初始化，不是0也可以是初始化 
	d = 10;//赋值 
	
	d = d + 3;
	d += 3; //d=d+3,一样的，相当于用加法赋值给d多一个3
	
	d = d - 3;
	d -=3; //d=d-3,一样的，相当于用减法赋值给d多一个3
	
	//后面那几个以此类推 
	
	
	
	//单目操作符 
	
	//a + b  的 + 是双目操作符 ，a和b是两个操作数 
	//单目操作符 ——只有一个操作数的操作符 
	
	
	//c语言中，0为假，非0为真
	 
	int flag1 = 0;//0为假
	int flag2 = 2;//非0为真
	if(!flag1){
		printf("hi");//打印hi 
		//如果！flag1为真就打印hi，既flag1为假就打印hi 
	}
	
	
	int aa = -10;
	int bb = -aa;//10
	printf("%d\n",bb);//10
	
	
	
	//sizeof操作符是单目操作符，不是函数 
	
	int aaa = 10;
	printf("%d\n",sizeof(aaa)); //4,a所占空间大小 
	printf("%d\n",sizeof(int)); //4，a的类型int所占的空间大小
	
	int arr[10]={0};
	printf("%d\n",sizeof(arr));//40,计算的是整个数组的大小，单位是字节
							   //int是4字节，4*10=40
	printf("%d\n",sizeof(arr)[0]);//4
	printf("%d\n",sizeof(arr)/sizeof(arr)[0]);//40/4=10
	
	// ++
	int q = 10;
	int w = q++;//后置++，先使用，后++
	//w=q;q=q+1; 
	printf("q=%d\n",q);//11
	printf("w=%d\n",w);//10	
	
	int r = ++q;//前置++，先++，后使用
	printf("r=%d\n",r);//12	
	// --
	int z = 10;
	int x = z--;//后置++，先使用，后--
	//x=z; z-=; 
	printf("z=%d\n",z);//9
	printf("x=%d\n",x);//10	
	
	int v = --z;//前置--，先--，后使用
	printf("v=%d\n",v);//8	
	
	//强制转换  (类型)
	int qq=3.14;//3.14为字面浮点型，double类型 
	int ww=(int)3.14;//double类型的3.14强制转换为int，为3 
	
 
	//关系操作符
	//	>	<	==	<=	>=	!=
	
	//逻辑操作符
	// &&逻辑与  	||逻辑或 
	 
	 a=0;
	 b=2; 
	 if(a&&b){//a和b不为0，都是真，若ab有一个为0，就为假 
	 	printf("逻辑与成立\n");//不打印 
	 }
	 if(a||b){//a和b都为0，就为假， 若ab有一个为1，就为真 
	 	printf("逻辑或成立\n");	//打印 
	 } 
	
	
	//条件操作符,也叫三目操作符 
	// exp1?exp2:exp3
	// 表达示1为真；2算，√；3不算，×，整个结果为2的结果 
	// 表达示1为假；2不算，×；3算，√，整个结果为3的结果 
	
	a =10;
	b =20;
	int ccc =(a > b ? a : b);
	//a>b为假，输出b 
	
	
	//逗号表达式
	
	//特点：从左向右依次计算，整个表达式的结果是最后一个表达式的结果 
	
	a = 10;
	b = 20;
	c = 0;
	//	c=12  a=32   31
	d =(c=a+2,a=b+c,a-1);//31,输出第三个结果 
	printf("d=%d\n",d);			   	 
	
	//下标引用操作符
	
	 int arr5[3] = {1,2,3};
	 arr5[1];//[]就是下标引用操作符，arr和1就是[]的操作符
	
	int l = 1;
	arr5[l] = 10;//把2改成10
	//定义的时候不能为变量 ，访问元素的时候可以用变量 
	
	printf("arr5[1]=%d\n",arr5[1]); 
	
	
	
	//函数调用操作符
	
	 int sum = add(2,3);// ()就是函数操作符，add，2，3 都是（）的操作数 
	
	return 0;
}
